{"country":"United States","industry":"Communication Equipment","sector":"Technology","employees":512,"phone":"345 943 3100","ceo":"Mr. Atul  Bhatnagar","url":"http://www.cambiumnetworks.com","description":"Cambium Networks Corporation, through its subsidiaries, provides wireless broadband networking infrastructure products and solutions for network operators. Its wireless fabric includes intelligent radios, smart antennas, radio frequency (RF) algorithms, wireless-aware switches, and network management software. The company offers point-to-point backhaul, point-to-multipoint distribution, Wi-Fi access, cnMatrix ethernet enterprise switching, cnReach IIoT, cnVision video surveillance transport, and cnMaestro and network management tools and solutions. It also offers point-to-point solutions that are connected to high-speed, high-bandwidth wireline networks; and wireless broadband backhaul to facilities or point-to-multipoint access points deployed throughout a network over distances of approximately 100 kilometers and at 2 gigabytes per second. The company also offers cnPilot and Xirrus Wi-Fi solution provides distributed access to individual users in indoor settings, such as office complexes, and outdoor settings, such as athletic stadiums; cnReach solutions offer narrow-band connectivity for sensors and devices; embedded proprietary RF technology and software enables automated optimization of data flow at the outermost points in the network; and cnMatrix cloud-managed wireless-aware switching solution provides the interface between wireless and wired networks. It serves medium-sized wireless internet service providers, enterprises, and government agencies in North America, Europe, the Middle East, Africa, Central and Latin America, and the Asia Pacific. The company was formerly known as Vector Cambium Holdings (Cayman), Ltd. and changed its name to Cambium Networks Corporation in 2018. The was founded in 2011 and is headquartered in Rolling Meadows, Illinois.","exchange":"Nasdaq Global Select","symbol":"CMBM","exchangeSymbol":"NGS","hq_address":"3800 Golf Road","hq_state":"IL","hq_country":"United States","active":true}